module.exports = {
    config: {
        name: "fact2",
        description: "বাংলা মজার তথ্য"
    },

    run: async ({ api, event }) => {
        const { threadID, messageID } = event;
        
        const facts = [
            "🐙 অক্টোপাসের তিনটি হৃদয় আছে",
            "🦒 জিরাফ জিহ্বা দিয়ে নিজের কান পরিষ্কার করতে পারে",
            "🍌 কলা বেরি, কিন্তু স্ট্রবেরি বেরি না",
            "🐧 পেঙ্গুইন হাঁটু আছে কিন্তু দেখা যায় না",
            "🍯 মধু কখনো নষ্ট হয় না। 3000 বছরের পুরান মধু খাওয়া যায়",
            "🦈 হাঙ্গরের কঙ্কাল হাড়ের না, তরুণাস্থির তৈরি",
            "🐘 হাতি লাফাতে পারে না",
            "☕ কফি আসলে চেরি ফলের বীজ",
            "🐌 শামুক 3 বছর ঘুমাতে পারে",
            "🧠 মানুষের মস্তিষ্ক 20 ওয়াট বিদ্যুৎ তৈরি করে"
        ];
        
        const fact = facts[Math.floor(Math.random() * facts.length)];
        api.sendMessage(`💡 জানেন কি? 💡\n━━━━━━━━━━━━━━━\n${fact}`, threadID, messageID);
    }
}
